sosukigara/2025_NIGINIGI_ESP32_OTA/src/main.cpp
/* History List */
.history-row {
  display: flex; justify-content: space-between; align-items: center;
  padding: 12px 0; border-bottom: 1px solid #f2f2f7;
}
.history-row:last-child { border-bottom: none; }
.h-info { display: flex; flex-direction: column; gap: 2px; }
.h-preset { font-weight: 700; font-size: 1rem; color: var(--text-main); }
.h-detail { font-size: 0.85rem; color: var(--text-sub); }
.h-time { font-family: monospace; font-size: 0.9rem; color: var(--accent-purple); font-weight: 600; }

/* Bottom Bar */
.bottom-bar {
  position: fixed; bottom: 30px; left: 18px; right: 18px;
  z-index: 100; display: flex; gap: 12px;
  filter: drop-shadow(0 10px 20px rgba(0,0,0,0.1));
}
.action-btn {
  flex: 1; height: 68px; border-radius: 34px; border: none;
  font-size: 1.2rem; font-weight: 800;
  display: flex; align-items: center; justify-content: center; gap: 8px;
  cursor: pointer; box-shadow: inset 0 1px 1px rgba(255,255,255,0.4);
  transition: transform 0.1s;
}
.action-btn:active { transform: scale(0.98); }
.btn-start { background: var(--text-main); color: white; }
.btn-stop { background: var(--danger); color: white; display: none; }
.running .btn-start { display: none; }
.running .btn-stop { display: flex; }

/* Toggle Switch */
.switch { position: relative; display: inline-block; width: 50px; height: 28px; }
.switch input { opacity: 0; width: 0; height: 0; }
.slider {
  position: absolute; cursor: pointer; top: 0; left: 0; right: 0; bottom: 0;
  background-color: #e5e5ea; transition: .4s; border-radius: 28px;
}
.slider:before {
  position: absolute; content: ""; height: 20px; width: 20px;
  left: 4px; bottom: 4px; background-color: white; transition: .4s; border-radius: 50%;
  box-shadow: 0 2px 4px rgba(0,0,0,0.2);
}
input:checked + .slider { background-color: var(--accent-blue); }
input:checked + .slider:before { transform: translateX(22px); }

/* Completion Modal */
.completion-modal {
  position: fixed; top: 0; left: 0; right: 0; bottom: 0;
  background: rgba(0,0,0,0.7); /* 少し薄暗く */
  backdrop-filter: blur(4px);   /* 背景ぼかしでリッチに */
  -webkit-backdrop-filter: blur(4px);
  display: none; align-items: center; justify-content: center;
  z-index: 1000;
  animation: fadeIn 0.3s;
}
.completion-modal.show { display: flex; }

.completion-content {
  background: var(--card-bg);
  border-radius: 28px;
  padding: 32px 28px; /* パディング調整 */
  text-align: center;
  max-width: 85%; width: 340px;
  box-shadow: 0 20px 40px rgba(0,0,0,0.2);
  animation: scaleIn 0.3s cubic-bezier(0.34, 1.56, 0.64, 1);
}

.completion-title {
  font-size: 1.6rem; /* 少し控えめに */
  font-weight: 800;
  color: var(--text-main);
  margin-bottom: 24px; /* 間隔を広げる */
}

.completion-details {
  text-align: left;
  background: var(--bg);
  padding: 16px 20px;
  border-radius: 16px;
  margin-bottom: 24px;
}

.detail-row {
  display: flex;
  justify-content: space-between;
  align-items: center;
  padding: 10px 0;
  border-bottom: 1px solid rgba(0,0,0,0.05);
}
.detail-row:last-child { border-bottom: none; }

.detail-label {
  font-size: 0.9rem;
  color: var(--text-sub);
  font-weight: 600;
}

.detail-value {
  font-size: 1.0rem;
  color: var(--text-main);
  font-weight: 700;
}

.completion-btn {
  background: var(--text-main); /* 黒ボタンで引き締める */
  color: white;
  border: none;
  padding: 16px 32px;
  border-radius: 30px;
  font-size: 1.0rem;
  font-weight: 700;
  cursor: pointer;
  transition: transform 0.2s;
  width: 100%;
}
.completion-btn:active { transform: scale(0.96); opacity: 0.9; }

@keyframes fadeIn {
  from { opacity: 0; }
  to { opacity: 1; }
}

@keyframes scaleIn {
  from { transform: scale(0.9); opacity: 1; }
  to { transform: scale(1); opacity: 1; }
}

/* Responsive */
@media (max-height: 750px) {
  body { padding: 12px; padding-bottom: 100px; }
  .header { margin-bottom: 10px; }
  .header h1 { font-size: 1.6rem; }
  .card { padding: 14px; margin-bottom: 10px; }
  .time-big { font-size: 3.5rem; }
  .status-badge { font-size: 0.8rem; padding: 4px 10px; }
  .action-btn { height: 56px; font-size: 1.1rem; }
}
</style>
</head>
<body>

<!-- VIEW: MAIN -->
<div id="view-main">
  <div class="header">
    <div style="display:flex; align-items:center;">
      <div class="conn-dot" id="conn-dot"></div>
      <h1>にぎにぎ</h1>
    </div>
    <div class="header-actions">
        <!-- History Icon -->
        <button class="btn-icon" onclick="showHistory()">
          <span class="material-icons-round" style="font-size: 28px;">history</span>
        </button>
        <!-- Settings Icon -->
        <button class="btn-icon" onclick="showSettings()">
          <span class="material-icons-round" style="font-size: 28px;">settings</span>
        </button>
    </div>
  </div>

  <!-- 1. Monitor -->
  <div class="card card-monitor">
    <div class="monitor-row">
      <div class="status-badge" id="status-badge">待機中</div>
      <div class="time-big" id="time-display">--:--</div>
    </div>
    <div class="yt-progress-container">
      <div class="yt-progress-fill" id="yt-fill"></div>
    </div>
  </div>

  <!-- 2. Preset -->
  <div class="card card-preset">
    <h3>プリセット</h3>
    <div class="preset-grid" style="grid-template-columns: 1fr 1fr 1fr;">
      <div class="preset-btn" onclick="setPreset('soft',this)" data-name="やわらか">やわらか</div>
      <div class="preset-btn active" onclick="setPreset('normal',this)" data-name="ふつう">ふつう</div>
      <div class="preset-btn" onclick="setPreset('kosen',this)" data-name="高専生用">高専生用</div>
    </div>
  </div>

  <!-- 3. Settings (Basic) -->
  <div class="card card-settings">
    <div class="setting-item">
      <div class="s-header">
        <span class="s-label">握りの強さ</span>
        <span class="s-val" id="str-disp">50%</span>
      </div>
      <input type="range" id="inp-str" min="0" max="100" value="50" oninput="updVal('str-disp', this.value, '%')">
    </div>
    
    <div class="setting-item" style="flex-direction:row; align-items:center; justify-content:space-between; padding:16px 0;">
      <span class="s-label">回数</span>
      <div class="chk-group">
        <div class="chk-btn" onclick="setCount(1,this)">1</div>
        <div class="chk-btn" onclick="setCount(2,this)">2</div>
        <div class="chk-btn active" onclick="setCount(3,this)">3</div>
        <div class="chk-btn" onclick="setCount(4,this)">4</div>
      </div>
    </div>
  </div>

